#+TITLE: CALCULATIONAL LOGIC
#+AUTHOR: Brian Beckman
#+DATE: 2018-09-09 Sun


#+OPTIONS: ':t *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline author:t c:nil
#+OPTIONS: d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t
#+OPTIONS: num:t p:nil pri:nil stat:t tags:t tasks:t tex:t timestamp:t toc:nil
#+OPTIONS: todo:t |:t
#+SELECT_TAGS: export
#+STARTUP: indent
# #+LaTeX_CLASS: extarticle
#+LaTeX_CLASS_OPTIONS: [10pt,oneside,x11names]

#+LaTeX_HEADER: \usepackage[left=2cm, right=2cm, top=2cm, bottom=2cm]{geometry}

#+LaTeX_HEADER: \usepackage{amsmath}
#+LaTeX_HEADER: \usepackage{amssymb}
#+LaTeX_HEADER: \usepackage{amsfonts}
#+LaTeX_HEADER: \usepackage{palatino}
#+LaTeX_HEADER: \usepackage{siunitx}
#+LaTeX_HEADER: \usepackage{esdiff}
#+LaTeX_HEADER: \usepackage{xfrac}
#+LaTeX_HEADER: \usepackage{nicefrac}
#+LaTeX_HEADER: \usepackage{faktor}
#+LaTeX_HEADER: \usepackage{faktor}
#+LaTeX_HEADER: \usepackage{lineno}
#+LaTeX_HEADER: \linenumbers
#+LaTeX_HEADER: \usepackage[euler-digits,euler-hat-accent]{eulervm}

# #+LaTeX_HEADER: \usepackage{scrextend}
# #+LaTeX_HEADER: \changefontsizes[10pt]{9pt}

# #+LaTeX_HEADER: \usepackage{fancyhdr}
# #+LaTeX_HEADER: \pagestyle{fancy}
# #+LaTeX_HEADER: \lhead{DOLPHIN}
# #+LaTeX_HEADER: \rhead{\today}
# #+LaTeX_HEADER: \lfoot{Amazon.com Confidential}
# # #+LaTeX_HEADER: \rfoot{\thepage}
# #+LaTeX_HEADER: \renewcommand{\headrulewidth}{0.4pt}
# #+LaTeX_HEADER: \renewcommand{\footrulewidth}{0.4pt}

* COMMENT Preliminaries

This section is just about setting up org-mode. It shouldn't export to the
typeset PDF and HTML.

#+BEGIN_SRC emacs-lisp :exports none
  (defun update-equation-tag ()
    (interactive)
    (save-excursion
      (goto-char (point-min))
      (let ((count 1))
        (while (re-search-forward "\\tag{\\([0-9]+\\)}" nil t)
          (replace-match (format "%d" count) nil nil nil 1)
          (setq count (1+ count))))))
  (update-equation-tag)
  (setq org-confirm-babel-evaluate nil)
  ; (org-babel-map-src-blocks nil (org-babel-remove-result))
  ; (slime)
#+END_SRC

#+RESULTS:



#+BEGIN_SRC python :results none :session f441d9ca
x = int("46")
#+END_SRC

#+BEGIN_SRC python :results output :session f441d9ca
print(x)
#+END_SRC

#+RESULTS:
: 46



#+BEGIN_SRC mathics :results output :session 1d0d4305
asdf
#+END_SRC

#+RESULTS:
: 59



* INTRODUCTION                                                        :GREEN:
  - foo
  - bar
  - [ ] baz
  - [ ] qux



* OMG                                                                   :RED:
  :LOGBOOK:
  CLOCK: [2018-09-09 Sun 19:10]--[2018-09-09 Sun 19:12] =>  0:02
  :END:
  OK, I am tracking time, here.



* REFERENCES :noexport:

[fn:optral] http://www.mit.edu/~shayegan/files/omidshafiei_optimal_racing_line_control14.pdf
[fn:fpwhop] http://web.cecs.pdx.edu/~mpj/pubs/springschool95.pdf
[fn:twosds] https://www.ics.uci.edu/~cs230/reading/jefferson.pdf
[fn:itareg] https://en.wikipedia.org/wiki/International_Traffic_in_Arms_Regulations
[fn:mcclam] https://arxiv.org/pdf/0707.1196.pdf
[fn:guangy] https://minerva-access.unimelb.edu.au/handle/11343/37225
[fn:nlinkm] http://blog.wolfram.com/2011/03/01/stabilized-n-link-pendulum/
[fn:contrl] https://en.wikipedia.org/wiki/State-space_representation#Controllability
[fn:googst] https://tiny.amazon.com/n3h8gibj/techs6099goog
[fn:unpub3] Unpublished Mathematica notebook
[fn:diffic] https://arxiv.org/abs/1709.06560
